In [8]:
from sqlalchemy import create_engine

import pandas as pd

import seaborn as sns

from matplotlib import pyplot as plt

In [9]:
database_name = 'scooters'

 

connection_string = f'postgresql://postgres:postgres@localhost:5432/{database_name}'

 

engine = create_engine(connection_string)

# our team decided to mobcode

In [36]:
TOTALSCOOTERS = '''

SELECT COMPANYNAME,

COUNT(DISTINCT(SUMDID)) COUNTS

FROM scooters

WHERE UPPER(SUMDGROUP) = 'SCOOTER'

GROUP BY

COMPANYNAME

'''

SCOOTERCOUNT = pd.read_sql_query(TOTALSCOOTERS, engine)

SCOOTERCOUNT

  companyname  counts
0        Bird    3860
1        Bolt     360
2      Gotcha     224
3        Jump    1210
4        Lime    1818
5        Lyft    1735
6        Spin     805

In [10]:
query = '''

SELECT companyname, SUM(tripduration)

FROM trips

WHERE tripduration IS NOT NULL

GROUP BY companyname

'''

 

pd.read_sql(query, con = engine)

     companyname           sum
0           Bird  2.046202e+06
1  Bolt Mobility  3.082150e+07
2         Gotcha  3.380278e+04
3           JUMP  2.110013e+05
4           Lime  3.507335e+06
5           Lyft  1.936370e+06
6           SPIN  9.005750e+05

In [11]:
query = '''
SELECT *
FROM scooters
Limit 100;
'''
pd.read_sql(query, con = engine)

,pubdatetime,latitude,longitude,sumdid,sumdtype,chargelevel,sumdgroup,costpermin,companyname
0,2019-05-01 00:01:41.247,36.136822,-86.799877,PoweredLIRL1,Powered,93.0,scooter,0.0,Bird
1,2019-05-01 00:01:41.247,36.191252,-86.772945,PoweredXWRWC,Powered,35.0,scooter,0.0,Bird
2,2019-05-01 00:01:41.247,36.144752,-86.806293,PoweredMEJEH,Powered,90.0,scooter,0.0,Bird
3,2019-05-01 00:01:41.247,36.162056,-86.774688,Powered1A7TC,Powered,88.0,scooter,0.0,Bird
4,2019-05-01 00:01:41.247,36.150973,-86.783109,Powered2TYEF,Powered,98.0,scooter,0.0,Bird
...,...,...,...,...,...,...,...,...,...
95,2019-05-01 00:01:41.247,36.141158,-86.801997,PoweredWDMWW,Powered,69.0,scooter,0.0,Bird
96,2019-05-01 00:01:41.247,36.138786,-86.801667,PoweredSNB79,Powered,88.0,scooter,0.0,Bird
97,2019-05-01 00:01:41.247,36.162634,-86.781603,PoweredM69E2,Powered,91.0,scooter,0.0,Bird
98,2019-05-01 00:01:41.247,36.144795,-86.795576,PoweredHY38F,Powered,88.0,scooter,0.0,Bird
99,2019-05-01 00:01:41.247,36.165809,-86.777780,Powered2WLYW,Powered,98.0,scooter,0.0,Bird

In [12]:
scooters=pd.read_sql(query, con = engine)
scooters.head()

,pubdatetime,latitude,longitude,sumdid,sumdtype,chargelevel,sumdgroup,costpermin,companyname
0,2019-05-01 00:01:41.247,36.136822,-86.799877,PoweredLIRL1,Powered,93.0,scooter,0.0,Bird
1,2019-05-01 00:01:41.247,36.191252,-86.772945,PoweredXWRWC,Powered,35.0,scooter,0.0,Bird
2,2019-05-01 00:01:41.247,36.144752,-86.806293,PoweredMEJEH,Powered,90.0,scooter,0.0,Bird
3,2019-05-01 00:01:41.247,36.162056,-86.774688,Powered1A7TC,Powered,88.0,scooter,0.0,Bird
4,2019-05-01 00:01:41.247,36.150973,-86.783109,Powered2TYEF,Powered,98.0,scooter,0.0,Bird

In [13]:
scooters=pd.read_sql(query, con = engine)
scooters.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 100 entries, 0 to 99
Data columns (total 9 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   pubdatetime  100 non-null    datetime64[ns]
 1   latitude     100 non-null    float64
 2   longitude    100 non-null    float64
 3   sumdid       100 non-null    object
 4   sumdtype     100 non-null    object
 5   chargelevel  100 non-null    float64
 6   sumdgroup    100 non-null    object
 7   costpermin   100 non-null    float64
 8   companyname  100 non-null    object
dtypes: datetime64[ns](1), float64(4), object(4)
memory usage: 7.2+ KB

In [14]:
totalscooters = '''
SELECT COUNT(DISTINCT(sumdid))
FROM scooters;
'''

scootercount = pd.read_sql(totalscooters, con = engine)
scootercount

   count
0  10018

In [15]:
everycompanycount = '''
SELECT companyname, COUNT(DISTINCT(sumdid))
FROM scooters
GROUP BY companyname;
'''

companycount = pd.read_sql(everycompanycount, con = engine)
companycount

  companyname  count
0        Bird   3860
1        Bolt    360
2      Gotcha    224
3        Jump   1210
4        Lime   1824
5        Lyft   1735
6        Spin    805

In [16]:
timeframe = '''
SELECT MIN(pubdatetime), MAX(pubdatetime)
FROM scooters
'''
scooterstimeframe = pd.read_sql(timeframe, con = engine)
scooterstimeframe

                      min                 max
0 2019-05-01 00:01:41.247 2019-07-31 23:59:57

#1. During this period, seven companies offered scooters. How many scooters did each company have in this time frame? Did the number for each company change over time? Did scooter usage vary by company?

In [17]:
SUMGRP ='''

SELECT SUMDGROUP

FROM scooters 

GROUP BY SUMDGROUP

'''
GROUPTYPE = pd.read_sql_query(SUMGRP, engine)

GROUPTYPE

  sumdgroup
0   bicycle
1   scooter
2   Scooter

In [18]:
JUSTSCOOTERS = '''

SELECT *

FROM scooters

WHERE UPPER(SUMDGROUP) = 'SCOOTER'

AND SUMDID = 'Powered3c24659f-37f5-5549-895c-bccf6d1ab656'

'''

SCOOTERSONLY = pd.read_sql_query(JUSTSCOOTERS , engine)

SCOOTERSONLY.head()

,pubdatetime,latitude,longitude,sumdid,sumdtype,chargelevel,sumdgroup,costpermin,companyname
0,2019-05-17 10:17:12,36.1204,-86.7533,Powered3c24659f-37f5-5549-895c-bccf6d1ab656,Powered,1.0,scooter,0.0,Jump
1,2019-05-17 10:22:12,36.1204,-86.7533,Powered3c24659f-37f5-5549-895c-bccf6d1ab656,Powered,1.0,scooter,0.0,Jump
2,2019-05-17 10:27:12,36.1204,-86.7533,Powered3c24659f-37f5-5549-895c-bccf6d1ab656,Powered,1.0,scooter,0.0,Jump
3,2019-05-17 10:32:12,36.1204,-86.7533,Powered3c24659f-37f5-5549-895c-bccf6d1ab656,Powered,1.0,scooter,0.0,Jump
4,2019-05-18 14:03:13,36.1538,-86.7957,Powered3c24659f-37f5-5549-895c-bccf6d1ab656,Powered,0.0,scooter,0.0,Jump

#1a How many scooters did each company have in this time frame?

In [19]:
TOTALSCOOTERS = '''

SELECT COMPANYNAME,

COUNT(DISTINCT(SUMDID)) COUNTS

FROM scooters

WHERE UPPER(SUMDGROUP) = 'SCOOTER'

GROUP BY

COMPANYNAME

'''

SCOOTERCOUNT = pd.read_sql_query(TOTALSCOOTERS, engine)

SCOOTERCOUNT

  companyname  counts
0        Bird    3860
1        Bolt     360
2      Gotcha     224
3        Jump    1210
4        Lime    1818
5        Lyft    1735
6        Spin     805

#1b Did the number for each company change over time?

Answer:  Yes, the numbers changed over time for each company.

In [20]:
JUSTSCOOTERS1 = '''

SELECT 

UPPER(SUMDGROUP),

UPPER(COMPANYNAME) COMPANYNAME,

TO_CHAR(PUBDATETIME,'MM') MONTH_NUM,

TO_CHAR(PUBDATETIME,'MONTH') MONTH_NAME,

TO_CHAR(PUBDATETIME,'YYYY') YEAR_VAL,

COUNT(DISTINCT(SUMDID))

FROM SCOOTERS 

WHERE 

UPPER(SUMDGROUP) = 'SCOOTER'

---SUMDID ='Powered3c24659f-37f5-5549-895c-bccf6d1ab656'

GROUP BY

UPPER(COMPANYNAME),

UPPER(SUMDGROUP),

TO_CHAR(PUBDATETIME,'MM'),

TO_CHAR(PUBDATETIME,'MONTH'),

TO_CHAR(PUBDATETIME,'YYYY')

ORDER BY

UPPER(COMPANYNAME),

UPPER(SUMDGROUP),

TO_CHAR(PUBDATETIME,'MM'),

TO_CHAR(PUBDATETIME,'MONTH'),

TO_CHAR(PUBDATETIME,'YYYY')

'''

 

SCOOTERSONLY1 = pd.read_sql_query(JUSTSCOOTERS1 , engine)

SCOOTERSONLY1

      upper companyname month_num month_name year_val  count
0   SCOOTER        BIRD        05  MAY           2019   3064
1   SCOOTER        BIRD        06  JUNE          2019   2910
2   SCOOTER        BIRD        07  JULY          2019   2583
3   SCOOTER        BOLT        05  MAY           2019    346
4   SCOOTER        BOLT        06  JUNE          2019    333
5   SCOOTER        BOLT        07  JULY          2019    276
6   SCOOTER      GOTCHA        05  MAY           2019    223
7   SCOOTER      GOTCHA        06  JUNE          2019    223
8   SCOOTER      GOTCHA        07  JULY          2019    224
9   SCOOTER        JUMP        05  MAY           2019    976
10  SCOOTER        JUMP        06  JUNE          2019   1036
11  SCOOTER        JUMP        07  JULY          2019   1206
12  SCOOTER        LIME        05  MAY           2019   1631
13  SCOOTER        LIME        06  JUNE          2019   1455
14  SCOOTER        LIME        07  JULY          2019    902
15  SCOOTER        LYFT        05  MAY           2019   1376
16  SCOOTER        LYFT        06  JUNE          2019   1152
17  SCOOTER        LYFT        07  JULY          2019   1026
18  SCOOTER        SPIN        05  MAY           2019    687
19  SCOOTER        SPIN        06  JUNE          2019    713
20  SCOOTER        SPIN        07  JULY          2019    570

In [21]:
TOTALSCOOTERS = '''

SELECT COMPANYNAME,

COUNT(DISTINCT(SUMDID)) COUNTS

FROM scooters

WHERE UPPER(SUMDGROUP) = 'SCOOTER'

GROUP BY

COMPANYNAME

'''

SCOOTERCOUNT = pd.read_sql_query(TOTALSCOOTERS, engine)

SCOOTERCOUNT

  companyname  counts
0        Bird    3860
1        Bolt     360
2      Gotcha     224
3        Jump    1210
4        Lime    1818
5        Lyft    1735
6        Spin     805

#1c Did scooter usage vary by company?

#2 Are there any scooter companies in compliance with 2 and 3 part of this rule? Are there any trips above 24 hours and trips below 1 minute?

In [22]:
TESTSPEED ='''

SELECT *

FROM scooters TABLESAMPLE SYSTEM (1)

WHERE UPPER(SUMDGROUP) ='SCOOTER'

'''

SPEEDTEST= pd.read_sql_query(TESTSPEED , engine)

SPEEDTEST

,pubdatetime,latitude,longitude,sumdid,sumdtype,chargelevel,sumdgroup,costpermin,companyname
0,2019-05-01 00:03:45.373,36.159833,-86.776910,Powered937685,Powered,65.0,scooter,0.00,Lyft
1,2019-05-01 00:03:45.633,36.154148,-86.784681,Powered175693,Powered,93.0,scooter,0.00,Lyft
2,2019-05-01 00:03:46.323,36.160553,-86.783267,Powered752703,Powered,41.0,scooter,0.00,Lyft
3,2019-05-01 00:03:46.393,36.153096,-86.779479,Powered474509,Powered,80.0,scooter,0.00,Lyft
4,2019-05-01 00:03:46.547,36.147737,-86.806907,Powered211807,Powered,53.0,scooter,0.00,Lyft
...,...,...,...,...,...,...,...,...,...
716379,2019-07-31 23:51:07.960,36.131337,-86.778773,PoweredXASB4DIND63PG,Powered,100.0,scooter,0.15,Lime
716380,2019-07-31 23:51:07.960,36.138955,-86.825056,PoweredWMIQUU6VN4JSI,Powered,69.0,scooter,0.15,Lime
716381,2019-07-31 23:51:07.960,36.136813,-86.799698,PoweredFN5ME2LES6Y4O,Powered,100.0,scooter,0.15,Lime
716382,2019-07-31 23:51:07.960,36.140479,-86.766377,PoweredDRXEWR7LKAFV3,Powered,75.0,scooter,0.15,Lime
716383,2019-07-31 23:51:07.960,36.135566,-86.804978,PoweredVIEIPVJSNPOCQ,Powered,73.0,scooter,0.15,Lime

#this is a table sample only

In [23]:

TRIPSTESTSPEED1 ='''

SELECT *

FROM TRIPS TABLESAMPLE SYSTEM (1)

'''

SPEEDTESTTRIP1= pd.read_sql_query(TRIPSTESTSPEED1 , engine)

SPEEDTESTTRIP1

,pubtimestamp,companyname,triprecordnum,sumdid,tripduration,tripdistance,startdate,starttime,enddate,endtime,startlatitude,startlongitude,endlatitude,endlongitude,triproute,create_dt
0,2019-05-01 06:00:34.050,Lyft,LFT459,Powered456361,8.686067,2742.78224,2019-05-01,05:51:52.783333,2019-05-01,06:00:33.946666,36.150880,-86.795070,36.152950,-86.79018,"[(36.15088, -86.79507), (36.15083, -86.79514),...",2019-05-02 07:20:51.940
1,2019-05-01 06:01:09.690,Lyft,LFT460,Powered084995,6.837633,2004.59324,2019-05-01,05:54:19.286666,2019-05-01,06:01:09.546666,36.160670,-86.775640,36.158060,-86.77860,"[(36.16067, -86.77564), (36.1608, -86.77571), ...",2019-05-02 07:20:51.970
2,2019-05-01 06:01:23.910,Lyft,LFT461,Powered974794,7.303250,1847.11292,2019-05-01,05:54:05.610000,2019-05-01,06:01:23.806666,36.160970,-86.775780,36.157940,-86.77862,"[(36.16097, -86.77578), (36.16089, -86.7757), ...",2019-05-02 07:20:52.000
3,2019-05-01 06:04:06.417,Lyft,LFT462,Powered654594,35.258300,19799.86940,2019-05-01,05:28:50.806666,2019-05-01,06:04:06.303333,36.143060,-86.791840,36.132920,-86.79213,"[(36.14306, -86.79184), (36.1431, -86.79187), ...",2019-05-02 07:20:52.033
4,2019-05-01 06:05:05.760,Lyft,LFT463,Powered635347,35.160767,19744.09512,2019-05-01,05:29:56.006666,2019-05-01,06:05:05.653333,36.143060,-86.791870,36.132970,-86.79212,"[(36.14306, -86.79187), (36.14294, -86.79187),...",2019-05-02 07:20:52.063
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
5901,2019-07-31 21:45:25.963,Lyft,LFT620,Powered695890,14.548517,4012.46732,2019-07-31,21:30:52.816666,2019-07-31,21:45:25.726666,36.159060,-86.777410,36.156510,-86.78078,"[(36.15906, -86.77741), (36.15915, -86.77736),...",2019-08-01 10:35:30.287
5902,2019-07-31 21:45:54.190,Lyft,LFT621,Powered307257,42.129200,22755.90624,2019-07-31,21:03:46.363333,2019-07-31,21:45:54.113333,36.153100,-86.783460,36.176590,-86.74194,"[(36.1531, -86.78346), (36.15304, -86.7834), (...",2019-08-01 10:35:30.320
5903,2019-07-31 21:48:29.767,Lyft,LFT622,Powered127986,4.895983,2480.31504,2019-07-31,21:43:35.806666,2019-07-31,21:48:29.566666,36.148230,-86.808190,36.144960,-86.80360,"[(36.14823, -86.80819), (36.14817, -86.80825),...",2019-08-01 10:35:30.350
5904,2019-07-31 21:48:51.000,JUMP,JMP51,Powered4c30ccd4-fbd4-5af7-84dc-68b6239bcb3e,29.375550,1056.00000,2019-07-31,15:56:42,2019-07-31,16:26:04,36.154675,-86.784800,36.127350,-86.78915,"[('36.15473', '-86.784876'), ('36.154703', '-8...",2019-08-01 08:27:15.670
5905,2019-07-31 21:48:51.000,JUMP,JMP52,Powerede59c6731-eb09-5a58-81c8-ca5f7831718f,61.833534,9556.80000,2019-07-31,15:27:43,2019-07-31,16:29:33,36.150085,-86.812935,36.149895,-86.81278,"[('36.15031', '-86.8128'), ('36.150096', '-86....",2019-08-01 08:27:15.850

In [26]:
TRIPSCOOTER = '''
SELECT 'over 24' as status, companyname
FROM trips
WHERE tripduration > 1440
GROUP BY companyname
UNION
SELECT 'under 1 minute' as status, companyname
FROM trips
WHERE tripduration < 1
GROUP BY companyname
ORDER BY status
'''

scooterstriptime= pd.read_sql_query(TRIPSCOOTER, engine)
scooterstriptime

           status    companyname
0         over 24           SPIN
1         over 24  Bolt Mobility
2         over 24           Lyft
3  under 1 minute           Bird
4  under 1 minute           Lime
5  under 1 minute           Lyft

Answer:  #2b Answer Spin, Lyft and Bolt Mobility were over 24 hours and Lime, Lyft were out of compliance on under 1 minute.  All were not in compliance.

In [27]:
companiescompliant = '''
SELECT 'under 24' as status, companyname
FROM trips
WHERE tripduration <= 1440
GROUP BY companyname
UNION
SELECT 'over 1 minute' as status, companyname
FROM trips
WHERE tripduration > 1
GROUP BY companyname
ORDER BY status

'''

scooterstriptime= pd.read_sql_query(companiescompliant, engine)
scooterstriptime

           status    companyname
0   over 1 minute           Lyft
1   over 1 minute  Bolt Mobility
2   over 1 minute           Bird
3   over 1 minute           JUMP
4   over 1 minute           SPIN
5   over 1 minute         Gotcha
6   over 1 minute           Lime
7        under 24  Bolt Mobility
8        under 24         Gotcha
9        under 24           SPIN
10       under 24           JUMP
11       under 24           Lime
12       under 24           Bird
13       under 24           Lyft

Answer: #2c Jump and Gotcha were the only 2 companies within compliance.

#This query makes it more clean, companies that are in compliance (see below)

In [28]:
COMPLIANCE ='''

SELECT UPPER(companyname) COMPANYNAME
FROM TRIPS WHERE  UPPER(companyname) NOT IN 
(SELECT  COMPANYNAME FROM

(
SELECT UPPER(companyname) COMPANYNAME
FROM TRIPS
WHERE tripduration > 1440
UNION
SELECT 
UPPER(companyname) COMPANYNAME
FROM TRIPS
WHERE tripduration < 1) 
GROUP BY COMPANYNAME)
GROUP BY
UPPER(companyname) 

'''

COMPLIANT= pd.read_sql_query(COMPLIANCE, engine)
COMPLIANT

  companyname
0      GOTCHA
1        JUMP

#3. The goal of Metro Nashville is to have each scooter used a minimum of 3 times per day. Based on the data, what is the average number of trips per scooter per day? Make sure to consider the days that a scooter was available. How does this vary by company?

In [29]:
SCOOTERUSAGE = '''

SELECT 
T.*
FROM
TRIPS T TABLESAMPLE SYSTEM (1) 
WHERE SUMDID IN
(SELECT SUMDID FROM SCOOTERS TABLESAMPLE SYSTEM (1) WHERE UPPER(SUMDGROUP) ='SCOOTER')
AND T.tripduration > 1 AND T.tripduration < 1440

'''

USE = pd.read_sql_query(SCOOTERUSAGE, engine)
USE

,pubtimestamp,companyname,triprecordnum,sumdid,tripduration,tripdistance,startdate,starttime,enddate,endtime,startlatitude,startlongitude,endlatitude,endlongitude,triproute,create_dt
0,2019-05-01 02:13:38.963,Lyft,LFT196,Powered902144,35.043383,9186.35200,2019-05-01,01:38:36.250000,2019-05-01,02:13:38.853333,36.156570,-86.774350,36.155950,-86.774480,"[(36.15657, -86.77435), (36.15651, -86.77427),...",2019-05-02 07:20:39.363
1,2019-05-01 02:13:51.420,Lyft,LFT197,Powered741432,36.633367,8658.13676,2019-05-01,01:37:13.303333,2019-05-01,02:13:51.306666,36.156080,-86.774130,36.155880,-86.774380,"[(36.15608, -86.77413), (36.15616, -86.77416),...",2019-05-02 07:20:39.393
2,2019-05-03 01:08:08.797,Bird,BRD3317,Powered1IRMW,12.000000,2624.67200,2019-05-03,00:57:51.040000,2019-05-03,01:09:56.590000,36.165000,-86.776300,36.159300,-86.772600,"[(36.16491, -86.776254), (36.159337, -86.772514)]",2019-05-04 05:30:25.980
3,2019-05-01 02:16:01.500,Bird,BRD2714,PoweredUF71S,4.000000,328.08400,2019-05-01,02:13:58.956666,2019-05-01,02:17:46.806666,36.161200,-86.777500,36.162700,-86.778200,"[(36.161485, -86.777519), (36.162236, -86.7784...",2019-05-02 05:30:39.213
4,2019-05-01 02:16:01.500,Bird,BRD2719,PoweredNIEFA,5.000000,1968.50400,2019-05-01,02:11:46.706666,2019-05-01,02:16:30.136666,36.140600,-86.792900,36.135800,-86.792100,"[(36.140719, -86.792913), (36.140695, -86.7925...",2019-05-02 05:30:39.563
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
5232,2019-08-01 04:53:48.000,JUMP,JMP4,Powered1691872e-b176-5fc6-86ed-967d00644179,17.567150,7497.60000,2019-07-31,23:47:56,2019-08-01,00:05:30,36.154640,-86.798420,36.149390,-86.814156,"[('36.15464', '-86.798425'), ('36.15464', '-86...",2019-08-02 08:21:27.093
5233,2019-08-01 04:53:48.000,JUMP,JMP6,Poweredd913663d-659b-5afd-9a37-a1b85c6a36b2,11.364550,5808.00000,2019-07-31,23:57:37,2019-08-01,00:08:59,36.150910,-86.782810,36.159283,-86.777880,"[('36.150911', '-86.782806'), ('36.150431', '-...",2019-08-02 08:21:28.530
5234,2019-08-01 04:53:48.000,JUMP,JMP3,Powered5614e4fc-1971-5e5c-a545-0fd88cd3331d,17.497950,7075.20000,2019-07-31,23:47:43,2019-08-01,00:05:13,36.154633,-86.798340,36.149220,-86.813980,"[('36.154631', '-86.798341'), ('36.154631', '-...",2019-08-02 08:21:27.127
5235,2019-08-01 04:53:48.000,JUMP,JMP2,Powereda4712099-5e55-5332-996c-d6e5c910535d,3.154917,1320.00000,2019-07-31,23:57:19,2019-08-01,00:00:28,36.153015,-86.783585,36.152843,-86.779594,"[('36.153016', '-86.783586'), ('36.153016', '-...",2019-08-02 08:21:26.773
5236,2019-08-01 04:53:48.000,JUMP,JMP1,Poweredb8a3a269-d1ca-571f-9b2f-89b7399b5537,18.440650,7920.00000,2019-07-31,23:41:52,2019-08-01,00:00:18,36.153687,-86.784580,36.164158,-86.776900,"[('36.153685', '-86.784578'), ('36.153685', '-...",2019-08-02 08:21:26.803

In [30]:
SCOOTERUSAGE = '''

SELECT 
UPPER(COMPANYNAME) COMPANYNAME,
STARTDATE,
SUMDID,
COUNT(TRIPRECORDNUM) COUNT
FROM
TRIPS T TABLESAMPLE SYSTEM (1) 
WHERE SUMDID IN
(SELECT SUMDID FROM SCOOTERS TABLESAMPLE SYSTEM (1) WHERE UPPER(SUMDGROUP) ='SCOOTER')
AND T.tripduration > 1 AND T.tripduration < 1440 AND TRIPRECORDNUM IS NOT NULL
GROUP BY 
UPPER(COMPANYNAME),
STARTDATE,

SUMDID
HAVING COUNT(TRIPRECORDNUM) >1

'''

USE = pd.read_sql_query(SCOOTERUSAGE, engine)
USE

    companyname   startdate          sumdid  count
0          BIRD  2019-05-11    PoweredWMBZA      3
1          BIRD  2019-05-25    PoweredZT6X7      2
2          BIRD  2019-06-05    Powered3I7X6      2
3          BIRD  2019-06-05    PoweredHM2KY      2
4          BIRD  2019-06-28    PoweredW3WV1      2
..          ...         ...             ...    ...
114        LYFT  2019-07-27   Powered345929      2
115        LYFT  2019-07-30   Powered345929      2
116        SPIN  2019-06-09  Powered1083720      2
117        SPIN  2019-06-09  Powered3997320      2
118        SPIN  2019-06-19  Powered7179586      2

[119 rows x 4 columns]

In [33]:
AVGUSAGE= '''
WITH avg_count AS (
SELECT companyname, sumdid, ROUND(AVG(scooter_usage.sumdid_count),2) as avg_sumdid_count

FROM (
SELECT companyname, sumdid, DATE(create_dt) as usage_date, COUNT (*) as sumdid_count
FROM trips
GROUP BY sumdid, DATE(create_dt), companyname
    ) as scooter_usage
GROUP BY sumdid, companyname
ORDER BY avg_sumdid_count DESC
)
SELECT companyname, sumdid, avg_sumdid_count
FROM avg_count
WHERE avg_sumdid_count >= 3.0
'''

AVGUSAGEBYDAY= pd.read_sql_query(AVGUSAGE, engine)
AVGUSAGEBYDAY

,companyname,sumdid,avg_sumdid_count
0,JUMP,Poweredb671ffe4-2bca-5880-98ec-d36f65aa11a2,159.00
1,Bird,PoweredUNKNOWN,41.06
2,Lyft,Powered487723,21.50
3,Lime,PoweredEGRN7CFK6Q6K2,18.40
4,Gotcha,Powered569,18.00
...,...,...,...
2748,Bird,Powered2GR7G,3.00
2749,Bolt Mobility,Powered-44c78418-a8f1-ff86-c13e-eb8fdb8ddd6c,3.00
2750,Bird,PoweredBCB85,3.00
2751,Gotcha,Powered772,3.00
2752,Bird,PoweredEMPL7,3.00

In [36]:
SCOOTERUSAGEAVG = '''

WITH X AS (
SELECT
MAX(STARTDATE)-MIN(STARTDATE) TOTALDAYS,
COUNT(DISTINCT(SUMDID)) TOTALSCOOTERS,
COUNT(DISTINCT(SUMDID)) * (MAX(STARTDATE)-MIN(STARTDATE)) SCOOTERTOTALDAYS,
SUM(COUNTRECNUM) TOTALUSES,
SUM(COUNTRECNUM)/(COUNT(DISTINCT(SUMDID)) * (MAX(STARTDATE)-MIN(STARTDATE))) AVG_USE_DAY

FROM(
SELECT 
UPPER(COMPANYNAME) COMPANYNAME,
STARTDATE,
SUMDID,

COUNT(TRIPRECORDNUM) COUNTRECNUM

FROM
TRIPS T
WHERE SUMDID IN
(SELECT SUMDID FROM SCOOTERS WHERE UPPER(SUMDGROUP) ='SCOOTER')
AND T.tripduration > 1 AND T.tripduration < 1440 AND TRIPRECORDNUM IS NOT NULL
GROUP BY 
UPPER(COMPANYNAME),
STARTDATE,
SUMDID
HAVING COUNT(TRIPRECORDNUM) >1
ORDER BY STARTDATE,UPPER(COMPANYNAME)))
SELECT * FROM X

'''

USESCOOTER = pd.read_sql_query(SCOOTERUSAGEAVG, engine)
USESCOOTER

   totaldays  totalscooters  scootertotaldays  totaluses  avg_use_day
0         91           8625            784875   466913.0     0.594888

#3b

In [37]:
SCOOTERUSAGEAVGCOM = '''

WITH X AS (
SELECT
UPPER(COMPANYNAME) COMPANYNAME,
MAX(STARTDATE)-MIN(STARTDATE) TOTALDAYS,
COUNT(DISTINCT(SUMDID)) TOTALSCOOTERS,
COUNT(DISTINCT(SUMDID)) * (MAX(STARTDATE)-MIN(STARTDATE)) SCOOTERTOTALDAYS,
SUM(COUNTRECNUM) TOTALUSES,
CASE WHEN SUM(COUNTRECNUM) = 0 THEN 0 ELSE
SUM(COUNTRECNUM)/(COUNT(DISTINCT(SUMDID)) * (MAX(STARTDATE)-MIN(STARTDATE)))
END AVG_USE_DAY

FROM(
SELECT 
UPPER(COMPANYNAME) COMPANYNAME, STARTDATE, SUMDID,

COUNT(TRIPRECORDNUM) COUNTRECNUM
FROM
TRIPS T
WHERE SUMDID IN
(SELECT SUMDID FROM SCOOTERS WHERE UPPER(SUMDGROUP) ='SCOOTER')
AND T.tripduration > 1 AND T.tripduration < 1440 AND TRIPRECORDNUM IS NOT NULL
GROUP BY 
UPPER(COMPANYNAME), STARTDATE, SUMDID

HAVING COUNT(TRIPRECORDNUM) > 1
ORDER BY STARTDATE,UPPER(COMPANYNAME))
GROUP BY UPPER(COMPANYNAME)
)

SELECT * FROM X ORDER BY COMPANYNAME

'''

USESCOOTERCOM = pd.read_sql_query(SCOOTERUSAGEAVG, engine)
AVGSCOOTERUSECOM = USESCOOTERCOM["avg_use_day"]
AVGSCOOTERUSECOM

0    0.594888
Name: avg_use_day, dtype: float64

In [38]:
SCOOTERUSAGEAVGCOM = '''

WITH X AS (
SELECT
COMPANYNAME,
MAX(STARTDATE)-MIN(STARTDATE) TOTALDAYS,
COUNT(DISTINCT(SUMDID)) TOTALSCOOTERS,
COUNT(DISTINCT(SUMDID)) * (MAX(STARTDATE)-MIN(STARTDATE)) SCOOTERTOTALDAYS,
SUM(COUNTRECNUM) TOTALUSES,
CASE WHEN SUM(COUNTRECNUM) = 0 THEN 0 ELSE
SUM(COUNTRECNUM)/(COUNT(DISTINCT(SUMDID)) * (MAX(STARTDATE)-MIN(STARTDATE)))
END AVG_USE_DAY

FROM(
SELECT 
UPPER(COMPANYNAME) COMPANYNAME, STARTDATE, SUMDID,

COUNT(TRIPRECORDNUM) COUNTRECNUM
FROM
TRIPS T
WHERE SUMDID IN
(SELECT SUMDID FROM SCOOTERS WHERE UPPER(SUMDGROUP) ='SCOOTER')
AND T.tripduration > 1 AND T.tripduration < 1440 AND TRIPRECORDNUM IS NOT NULL
GROUP BY 

UPPER(COMPANYNAME), STARTDATE, SUMDID

HAVING COUNT(TRIPRECORDNUM) > 1
ORDER BY STARTDATE,UPPER(COMPANYNAME))
GROUP BY COMPANYNAME

)
SELECT COMPANYNAME, round(AVG_USE_DAY,2) AVG_USE_DAY FROM X 

'''

USESCOOTERCOM = pd.read_sql_query(SCOOTERUSAGEAVGCOM, engine)
USESCOOTERCOM

     companyname  avg_use_day
0           BIRD         0.32
1  BOLT MOBILITY         0.48
2         GOTCHA         0.24
3           JUMP         0.17
4           LIME         1.35
5           LYFT         0.69
6           SPIN         0.48